src/OpenFOAM/OpenFOAM-7/etc/templates/closedVolumeRotating/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInitial    1.0;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInitial;

boundaryField
{
    wall
    {
        type            omegaWallFunction;
        value           uniform $omegaInitial;
    }
}

// ************************************************************************* //
